/* automatically generated by rust-bindgen 0.58.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const __BITS_PER_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const IPSET_PROTOCOL: u32 = 7;
pub const IPSET_PROTOCOL_MIN: u32 = 6;
pub const IPSET_MAXNAMELEN: u32 = 32;
pub const IPSET_MAX_COMMENT_SIZE: u32 = 255;
pub const IPSET_INVALID_ID: u32 = 65535;
pub const SO_IP_SET: u32 = 83;
pub const IP_SET_OP_GET_BYNAME: u32 = 6;
pub const IP_SET_OP_GET_BYINDEX: u32 = 7;

pub const IPV6_RTHDRDSTOPTS: u32 = 55;
pub const IPV6_RECVRTHDR: u32 = 56;
pub const IPV6_RTHDR: u32 = 57;
pub const IPV6_RECVDSTOPTS: u32 = 58;
pub const IPV6_DSTOPTS: u32 = 59;
pub const IPV6_RECVPATHMTU: u32 = 60;
pub const IPV6_PATHMTU: u32 = 61;
pub const IPV6_DONTFRAG: u32 = 62;
pub const IPV6_RECVTCLASS: u32 = 66;
pub const IPV6_TCLASS: u32 = 67;
pub const IPV6_AUTOFLOWLABEL: u32 = 70;
pub const IPV6_ADDR_PREFERENCES: u32 = 72;
pub const IPV6_MINHOPCOUNT: u32 = 73;
pub const IPV6_ORIGDSTADDR: u32 = 74;
pub const IPV6_RECVORIGDSTADDR: u32 = 74;
pub const IPV6_TRANSPARENT: u32 = 75;
pub const IPV6_UNICAST_IF: u32 = 76;
pub const IPV6_RECVFRAGSIZE: u32 = 77;
pub const IPV6_FREEBIND: u32 = 78;
pub const IPV6_ADD_MEMBERSHIP: u32 = 20;
pub const IPV6_DROP_MEMBERSHIP: u32 = 21;
pub const IPV6_RXHOPOPTS: u32 = 54;
pub const IPV6_RXDSTOPTS: u32 = 59;
pub const IPV6_PMTUDISC_DONT: u32 = 0;
pub const IPV6_PMTUDISC_WANT: u32 = 1;
pub const IPV6_PMTUDISC_DO: u32 = 2;
pub const IPV6_PMTUDISC_PROBE: u32 = 3;
pub const IPV6_PMTUDISC_INTERFACE: u32 = 4;
pub const IPV6_PMTUDISC_OMIT: u32 = 5;
pub const SOL_IPV6: u32 = 41;
pub const SOL_ICMPV6: u32 = 58;
pub const IPV6_RTHDR_LOOSE: u32 = 0;
pub const IPV6_RTHDR_STRICT: u32 = 1;
pub const IPV6_RTHDR_TYPE_0: u32 = 0;
pub const IN_CLASSA_NET: u32 = 4278190080;
pub const IN_CLASSA_NSHIFT: u32 = 24;
pub const IN_CLASSA_HOST: u32 = 16777215;
pub const IN_CLASSA_MAX: u32 = 128;
pub const IN_CLASSB_NET: u32 = 4294901760;
pub const IN_CLASSB_NSHIFT: u32 = 16;
pub const IN_CLASSB_HOST: u32 = 65535;
pub const IN_CLASSB_MAX: u32 = 65536;
pub const IN_CLASSC_NET: u32 = 4294967040;
pub const IN_CLASSC_NSHIFT: u32 = 8;
pub const IN_CLASSC_HOST: u32 = 255;
pub const IN_LOOPBACKNET: u32 = 127;
pub const INET_ADDRSTRLEN: u32 = 16;
pub const INET6_ADDRSTRLEN: u32 = 46;
pub const IPSET_FLAGS_ALL: i32 = -1;
pub const IPSET_CIDR_SEPARATOR: &'static [u8; 2usize] = b"/\0";
pub const IPSET_RANGE_SEPARATOR: &'static [u8; 2usize] = b"-\0";
pub const IPSET_ELEM_SEPARATOR: &'static [u8; 2usize] = b",\0";
pub const IPSET_NAME_SEPARATOR: &'static [u8; 2usize] = b",\0";
pub const IPSET_PROTO_SEPARATOR: &'static [u8; 2usize] = b":\0";
pub const IPSET_ESCAPE_START: &'static [u8; 2usize] = b"[\0";
pub const IPSET_ESCAPE_END: &'static [u8; 2usize] = b"]\0";
pub const IPSET_DIM_UMAX: u32 = 3;
pub const IPSET_OPTARG_MAX: u32 = 24;
pub const IPSET_CMD_ALIASES: u32 = 3;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fsid_t>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
pub const ipset_cmd_IPSET_CMD_NONE: ipset_cmd = 0;
pub const ipset_cmd_IPSET_CMD_PROTOCOL: ipset_cmd = 1;
pub const ipset_cmd_IPSET_CMD_CREATE: ipset_cmd = 2;
pub const ipset_cmd_IPSET_CMD_DESTROY: ipset_cmd = 3;
pub const ipset_cmd_IPSET_CMD_FLUSH: ipset_cmd = 4;
pub const ipset_cmd_IPSET_CMD_RENAME: ipset_cmd = 5;
pub const ipset_cmd_IPSET_CMD_SWAP: ipset_cmd = 6;
pub const ipset_cmd_IPSET_CMD_LIST: ipset_cmd = 7;
pub const ipset_cmd_IPSET_CMD_SAVE: ipset_cmd = 8;
pub const ipset_cmd_IPSET_CMD_ADD: ipset_cmd = 9;
pub const ipset_cmd_IPSET_CMD_DEL: ipset_cmd = 10;
pub const ipset_cmd_IPSET_CMD_TEST: ipset_cmd = 11;
pub const ipset_cmd_IPSET_CMD_HEADER: ipset_cmd = 12;
pub const ipset_cmd_IPSET_CMD_TYPE: ipset_cmd = 13;
pub const ipset_cmd_IPSET_CMD_GET_BYNAME: ipset_cmd = 14;
pub const ipset_cmd_IPSET_CMD_GET_BYINDEX: ipset_cmd = 15;
pub const ipset_cmd_IPSET_MSG_MAX: ipset_cmd = 16;
pub const ipset_cmd_IPSET_CMD_RESTORE: ipset_cmd = 16;
pub const ipset_cmd_IPSET_CMD_HELP: ipset_cmd = 17;
pub const ipset_cmd_IPSET_CMD_VERSION: ipset_cmd = 18;
pub const ipset_cmd_IPSET_CMD_QUIT: ipset_cmd = 19;
pub const ipset_cmd_IPSET_CMD_MAX: ipset_cmd = 20;
pub const ipset_cmd_IPSET_CMD_COMMIT: ipset_cmd = 20;
pub type ipset_cmd = ::std::os::raw::c_uint;
pub const IPSET_ATTR_UNSPEC: ::std::os::raw::c_uint = 0;
pub const IPSET_ATTR_PROTOCOL: ::std::os::raw::c_uint = 1;
pub const IPSET_ATTR_SETNAME: ::std::os::raw::c_uint = 2;
pub const IPSET_ATTR_TYPENAME: ::std::os::raw::c_uint = 3;
pub const IPSET_ATTR_SETNAME2: ::std::os::raw::c_uint = 3;
pub const IPSET_ATTR_REVISION: ::std::os::raw::c_uint = 4;
pub const IPSET_ATTR_FAMILY: ::std::os::raw::c_uint = 5;
pub const IPSET_ATTR_FLAGS: ::std::os::raw::c_uint = 6;
pub const IPSET_ATTR_DATA: ::std::os::raw::c_uint = 7;
pub const IPSET_ATTR_ADT: ::std::os::raw::c_uint = 8;
pub const IPSET_ATTR_LINENO: ::std::os::raw::c_uint = 9;
pub const IPSET_ATTR_PROTOCOL_MIN: ::std::os::raw::c_uint = 10;
pub const IPSET_ATTR_REVISION_MIN: ::std::os::raw::c_uint = 10;
pub const IPSET_ATTR_INDEX: ::std::os::raw::c_uint = 11;
pub const __IPSET_ATTR_CMD_MAX: ::std::os::raw::c_uint = 12;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const IPSET_ATTR_IP: ::std::os::raw::c_uint = 1;
pub const IPSET_ATTR_IP_FROM: ::std::os::raw::c_uint = 1;
pub const IPSET_ATTR_IP_TO: ::std::os::raw::c_uint = 2;
pub const IPSET_ATTR_CIDR: ::std::os::raw::c_uint = 3;
pub const IPSET_ATTR_PORT: ::std::os::raw::c_uint = 4;
pub const IPSET_ATTR_PORT_FROM: ::std::os::raw::c_uint = 4;
pub const IPSET_ATTR_PORT_TO: ::std::os::raw::c_uint = 5;
pub const IPSET_ATTR_TIMEOUT: ::std::os::raw::c_uint = 6;
pub const IPSET_ATTR_PROTO: ::std::os::raw::c_uint = 7;
pub const IPSET_ATTR_CADT_FLAGS: ::std::os::raw::c_uint = 8;
pub const IPSET_ATTR_CADT_LINENO: ::std::os::raw::c_uint = 9;
pub const IPSET_ATTR_MARK: ::std::os::raw::c_uint = 10;
pub const IPSET_ATTR_MARKMASK: ::std::os::raw::c_uint = 11;
pub const IPSET_ATTR_CADT_MAX: ::std::os::raw::c_uint = 16;
pub const IPSET_ATTR_INITVAL: ::std::os::raw::c_uint = 17;
pub const IPSET_ATTR_HASHSIZE: ::std::os::raw::c_uint = 18;
pub const IPSET_ATTR_MAXELEM: ::std::os::raw::c_uint = 19;
pub const IPSET_ATTR_NETMASK: ::std::os::raw::c_uint = 20;
pub const IPSET_ATTR_BUCKETSIZE: ::std::os::raw::c_uint = 21;
pub const IPSET_ATTR_RESIZE: ::std::os::raw::c_uint = 22;
pub const IPSET_ATTR_SIZE: ::std::os::raw::c_uint = 23;
pub const IPSET_ATTR_ELEMENTS: ::std::os::raw::c_uint = 24;
pub const IPSET_ATTR_REFERENCES: ::std::os::raw::c_uint = 25;
pub const IPSET_ATTR_MEMSIZE: ::std::os::raw::c_uint = 26;
pub const __IPSET_ATTR_CREATE_MAX: ::std::os::raw::c_uint = 27;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const IPSET_ATTR_ETHER: ::std::os::raw::c_uint = 17;
pub const IPSET_ATTR_NAME: ::std::os::raw::c_uint = 18;
pub const IPSET_ATTR_NAMEREF: ::std::os::raw::c_uint = 19;
pub const IPSET_ATTR_IP2: ::std::os::raw::c_uint = 20;
pub const IPSET_ATTR_CIDR2: ::std::os::raw::c_uint = 21;
pub const IPSET_ATTR_IP2_TO: ::std::os::raw::c_uint = 22;
pub const IPSET_ATTR_IFACE: ::std::os::raw::c_uint = 23;
pub const IPSET_ATTR_BYTES: ::std::os::raw::c_uint = 24;
pub const IPSET_ATTR_PACKETS: ::std::os::raw::c_uint = 25;
pub const IPSET_ATTR_COMMENT: ::std::os::raw::c_uint = 26;
pub const IPSET_ATTR_SKBMARK: ::std::os::raw::c_uint = 27;
pub const IPSET_ATTR_SKBPRIO: ::std::os::raw::c_uint = 28;
pub const IPSET_ATTR_SKBQUEUE: ::std::os::raw::c_uint = 29;
pub const IPSET_ATTR_PAD: ::std::os::raw::c_uint = 30;
pub const __IPSET_ATTR_ADT_MAX: ::std::os::raw::c_uint = 31;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const IPSET_ATTR_IPADDR_IPV4: ::std::os::raw::c_uint = 1;
pub const IPSET_ATTR_IPADDR_IPV6: ::std::os::raw::c_uint = 2;
pub const __IPSET_ATTR_IPADDR_MAX: ::std::os::raw::c_uint = 3;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const ipset_errno_IPSET_ERR_PRIVATE: ipset_errno = 4096;
pub const ipset_errno_IPSET_ERR_PROTOCOL: ipset_errno = 4097;
pub const ipset_errno_IPSET_ERR_FIND_TYPE: ipset_errno = 4098;
pub const ipset_errno_IPSET_ERR_MAX_SETS: ipset_errno = 4099;
pub const ipset_errno_IPSET_ERR_BUSY: ipset_errno = 4100;
pub const ipset_errno_IPSET_ERR_EXIST_SETNAME2: ipset_errno = 4101;
pub const ipset_errno_IPSET_ERR_TYPE_MISMATCH: ipset_errno = 4102;
pub const ipset_errno_IPSET_ERR_EXIST: ipset_errno = 4103;
pub const ipset_errno_IPSET_ERR_INVALID_CIDR: ipset_errno = 4104;
pub const ipset_errno_IPSET_ERR_INVALID_NETMASK: ipset_errno = 4105;
pub const ipset_errno_IPSET_ERR_INVALID_FAMILY: ipset_errno = 4106;
pub const ipset_errno_IPSET_ERR_TIMEOUT: ipset_errno = 4107;
pub const ipset_errno_IPSET_ERR_REFERENCED: ipset_errno = 4108;
pub const ipset_errno_IPSET_ERR_IPADDR_IPV4: ipset_errno = 4109;
pub const ipset_errno_IPSET_ERR_IPADDR_IPV6: ipset_errno = 4110;
pub const ipset_errno_IPSET_ERR_COUNTER: ipset_errno = 4111;
pub const ipset_errno_IPSET_ERR_COMMENT: ipset_errno = 4112;
pub const ipset_errno_IPSET_ERR_INVALID_MARKMASK: ipset_errno = 4113;
pub const ipset_errno_IPSET_ERR_SKBINFO: ipset_errno = 4114;
pub const ipset_errno_IPSET_ERR_TYPE_SPECIFIC: ipset_errno = 4352;
pub type ipset_errno = ::std::os::raw::c_uint;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_EXIST: ipset_cmd_flags = 0;
pub const ipset_cmd_flags_IPSET_FLAG_EXIST: ipset_cmd_flags = 1;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_LIST_SETNAME: ipset_cmd_flags = 1;
pub const ipset_cmd_flags_IPSET_FLAG_LIST_SETNAME: ipset_cmd_flags = 2;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_LIST_HEADER: ipset_cmd_flags = 2;
pub const ipset_cmd_flags_IPSET_FLAG_LIST_HEADER: ipset_cmd_flags = 4;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_SKIP_COUNTER_UPDATE: ipset_cmd_flags = 3;
pub const ipset_cmd_flags_IPSET_FLAG_SKIP_COUNTER_UPDATE: ipset_cmd_flags = 8;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_SKIP_SUBCOUNTER_UPDATE: ipset_cmd_flags = 4;
pub const ipset_cmd_flags_IPSET_FLAG_SKIP_SUBCOUNTER_UPDATE: ipset_cmd_flags = 16;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MATCH_COUNTERS: ipset_cmd_flags = 5;
pub const ipset_cmd_flags_IPSET_FLAG_MATCH_COUNTERS: ipset_cmd_flags = 32;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_RETURN_NOMATCH: ipset_cmd_flags = 7;
pub const ipset_cmd_flags_IPSET_FLAG_RETURN_NOMATCH: ipset_cmd_flags = 128;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MAP_SKBMARK: ipset_cmd_flags = 8;
pub const ipset_cmd_flags_IPSET_FLAG_MAP_SKBMARK: ipset_cmd_flags = 256;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MAP_SKBPRIO: ipset_cmd_flags = 9;
pub const ipset_cmd_flags_IPSET_FLAG_MAP_SKBPRIO: ipset_cmd_flags = 512;
pub const ipset_cmd_flags_IPSET_FLAG_BIT_MAP_SKBQUEUE: ipset_cmd_flags = 10;
pub const ipset_cmd_flags_IPSET_FLAG_MAP_SKBQUEUE: ipset_cmd_flags = 1024;
pub const ipset_cmd_flags_IPSET_FLAG_CMD_MAX: ipset_cmd_flags = 15;
pub type ipset_cmd_flags = ::std::os::raw::c_uint;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_BEFORE: ipset_cadt_flags = 0;
pub const ipset_cadt_flags_IPSET_FLAG_BEFORE: ipset_cadt_flags = 1;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_PHYSDEV: ipset_cadt_flags = 1;
pub const ipset_cadt_flags_IPSET_FLAG_PHYSDEV: ipset_cadt_flags = 2;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_NOMATCH: ipset_cadt_flags = 2;
pub const ipset_cadt_flags_IPSET_FLAG_NOMATCH: ipset_cadt_flags = 4;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_COUNTERS: ipset_cadt_flags = 3;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_COUNTERS: ipset_cadt_flags = 8;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_COMMENT: ipset_cadt_flags = 4;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_COMMENT: ipset_cadt_flags = 16;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_FORCEADD: ipset_cadt_flags = 5;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_FORCEADD: ipset_cadt_flags = 32;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_WITH_SKBINFO: ipset_cadt_flags = 6;
pub const ipset_cadt_flags_IPSET_FLAG_WITH_SKBINFO: ipset_cadt_flags = 64;
pub const ipset_cadt_flags_IPSET_FLAG_BIT_IFACE_WILDCARD: ipset_cadt_flags = 7;
pub const ipset_cadt_flags_IPSET_FLAG_IFACE_WILDCARD: ipset_cadt_flags = 128;
pub const ipset_cadt_flags_IPSET_FLAG_CADT_MAX: ipset_cadt_flags = 15;
pub type ipset_cadt_flags = ::std::os::raw::c_uint;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BIT_FORCEADD: ipset_create_flags = 0;
pub const ipset_create_flags_IPSET_CREATE_FLAG_FORCEADD: ipset_create_flags = 1;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BIT_BUCKETSIZE: ipset_create_flags = 1;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BUCKETSIZE: ipset_create_flags = 2;
pub const ipset_create_flags_IPSET_CREATE_FLAG_BIT_MAX: ipset_create_flags = 7;
pub type ipset_create_flags = ::std::os::raw::c_uint;
pub const ipset_adt_IPSET_ADD: ipset_adt = 0;
pub const ipset_adt_IPSET_DEL: ipset_adt = 1;
pub const ipset_adt_IPSET_TEST: ipset_adt = 2;
pub const ipset_adt_IPSET_ADT_MAX: ipset_adt = 3;
pub const ipset_adt_IPSET_CREATE: ipset_adt = 3;
pub const ipset_adt_IPSET_CADT_MAX: ipset_adt = 4;
pub type ipset_adt = ::std::os::raw::c_uint;
pub type ip_set_id_t = __u16;
pub const ip_set_dim_IPSET_DIM_ZERO: ip_set_dim = 0;
pub const ip_set_dim_IPSET_DIM_ONE: ip_set_dim = 1;
pub const ip_set_dim_IPSET_DIM_TWO: ip_set_dim = 2;
pub const ip_set_dim_IPSET_DIM_THREE: ip_set_dim = 3;
pub const ip_set_dim_IPSET_DIM_MAX: ip_set_dim = 6;
pub const ip_set_dim_IPSET_BIT_RETURN_NOMATCH: ip_set_dim = 7;
pub type ip_set_dim = ::std::os::raw::c_uint;
pub const ip_set_kopt_IPSET_INV_MATCH: ip_set_kopt = 1;
pub const ip_set_kopt_IPSET_DIM_ONE_SRC: ip_set_kopt = 2;
pub const ip_set_kopt_IPSET_DIM_TWO_SRC: ip_set_kopt = 4;
pub const ip_set_kopt_IPSET_DIM_THREE_SRC: ip_set_kopt = 8;
pub const ip_set_kopt_IPSET_RETURN_NOMATCH: ip_set_kopt = 128;
pub type ip_set_kopt = ::std::os::raw::c_uint;
pub const IPSET_COUNTER_NONE: ::std::os::raw::c_uint = 0;
pub const IPSET_COUNTER_EQ: ::std::os::raw::c_uint = 1;
pub const IPSET_COUNTER_NE: ::std::os::raw::c_uint = 2;
pub const IPSET_COUNTER_LT: ::std::os::raw::c_uint = 3;
pub const IPSET_COUNTER_GT: ::std::os::raw::c_uint = 4;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_set_counter_match0 {
    pub op: __u8,
    pub value: __u64,
}
#[test]
fn bindgen_test_layout_ip_set_counter_match0() {
    assert_eq!(
        ::std::mem::size_of::<ip_set_counter_match0>(),
        16usize,
        concat!("Size of: ", stringify!(ip_set_counter_match0))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_set_counter_match0>(),
        8usize,
        concat!("Alignment of ", stringify!(ip_set_counter_match0))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_counter_match0>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_counter_match0),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_counter_match0>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_counter_match0),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_set_counter_match {
    pub value: __u64,
    pub op: __u8,
}
#[test]
fn bindgen_test_layout_ip_set_counter_match() {
    assert_eq!(
        ::std::mem::size_of::<ip_set_counter_match>(),
        16usize,
        concat!("Size of: ", stringify!(ip_set_counter_match))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_set_counter_match>(),
        8usize,
        concat!("Alignment of ", stringify!(ip_set_counter_match))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_counter_match>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_counter_match),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_counter_match>())).op as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_counter_match),
            "::",
            stringify!(op)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ip_set_name_index {
    pub name: [::std::os::raw::c_char; 32usize],
    pub index: ip_set_id_t,
}
#[test]
fn bindgen_test_layout_ip_set_name_index() {
    assert_eq!(
        ::std::mem::size_of::<ip_set_name_index>(),
        32usize,
        concat!("Size of: ", stringify!(ip_set_name_index))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_set_name_index>(),
        2usize,
        concat!("Alignment of ", stringify!(ip_set_name_index))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_name_index>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_name_index),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_name_index>())).index as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_name_index),
            "::",
            stringify!(index)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_set_req_get_set {
    pub op: ::std::os::raw::c_uint,
    pub version: ::std::os::raw::c_uint,
    pub set: ip_set_name_index,
}
#[test]
fn bindgen_test_layout_ip_set_req_get_set() {
    assert_eq!(
        ::std::mem::size_of::<ip_set_req_get_set>(),
        40usize,
        concat!("Size of: ", stringify!(ip_set_req_get_set))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_set_req_get_set>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_set_req_get_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_req_get_set>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_get_set),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_req_get_set>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_get_set),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_req_get_set>())).set as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_get_set),
            "::",
            stringify!(set)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_set_req_get_set_family {
    pub op: ::std::os::raw::c_uint,
    pub version: ::std::os::raw::c_uint,
    pub family: ::std::os::raw::c_uint,
    pub set: ip_set_name_index,
}
#[test]
fn bindgen_test_layout_ip_set_req_get_set_family() {
    assert_eq!(
        ::std::mem::size_of::<ip_set_req_get_set_family>(),
        44usize,
        concat!("Size of: ", stringify!(ip_set_req_get_set_family))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_set_req_get_set_family>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_set_req_get_set_family))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_req_get_set_family>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_get_set_family),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ip_set_req_get_set_family>())).version as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_get_set_family),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ip_set_req_get_set_family>())).family as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_get_set_family),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_req_get_set_family>())).set as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_get_set_family),
            "::",
            stringify!(set)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_set_req_version {
    pub op: ::std::os::raw::c_uint,
    pub version: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ip_set_req_version() {
    assert_eq!(
        ::std::mem::size_of::<ip_set_req_version>(),
        8usize,
        concat!("Size of: ", stringify!(ip_set_req_version))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_set_req_version>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_set_req_version))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_req_version>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_version),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_set_req_version>())).version as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_set_req_version),
            "::",
            stringify!(version)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type size_t = ::std::os::raw::c_ulong;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type off_t = __off_t;
pub type ssize_t = __ssize_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_session {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_data {
    _unused: [u8; 0],
}
extern "C" {
    pub fn ipset_session_data(session: *const ipset_session) -> *mut ipset_data;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_handle {
    _unused: [u8; 0],
}
extern "C" {
    pub fn ipset_session_handle(session: *const ipset_session) -> *mut ipset_handle;
}
extern "C" {
    pub fn ipset_saved_type(session: *const ipset_session) -> *const ipset_type;
}
extern "C" {
    pub fn ipset_session_lineno(session: *mut ipset_session, lineno: u32);
}
extern "C" {
    pub fn ipset_session_printf_private(session: *mut ipset_session)
        -> *mut ::std::os::raw::c_void;
}
pub const ipset_err_type_IPSET_NO_ERROR: ipset_err_type = 0;
pub const ipset_err_type_IPSET_WARNING: ipset_err_type = 1;
pub const ipset_err_type_IPSET_NOTICE: ipset_err_type = 2;
pub const ipset_err_type_IPSET_ERROR: ipset_err_type = 3;
pub type ipset_err_type = ::std::os::raw::c_uint;
extern "C" {
    pub fn ipset_session_report(
        session: *mut ipset_session,
        type_: ipset_err_type,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_session_warning_as_error(session: *mut ipset_session) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_session_report_reset(session: *mut ipset_session);
}
extern "C" {
    pub fn ipset_session_report_msg(session: *const ipset_session)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ipset_session_report_type(session: *const ipset_session) -> ipset_err_type;
}
pub const ipset_envopt_IPSET_ENV_BIT_SORTED: ipset_envopt = 0;
pub const ipset_envopt_IPSET_ENV_SORTED: ipset_envopt = 1;
pub const ipset_envopt_IPSET_ENV_BIT_QUIET: ipset_envopt = 1;
pub const ipset_envopt_IPSET_ENV_QUIET: ipset_envopt = 2;
pub const ipset_envopt_IPSET_ENV_BIT_RESOLVE: ipset_envopt = 2;
pub const ipset_envopt_IPSET_ENV_RESOLVE: ipset_envopt = 4;
pub const ipset_envopt_IPSET_ENV_BIT_EXIST: ipset_envopt = 3;
pub const ipset_envopt_IPSET_ENV_EXIST: ipset_envopt = 8;
pub const ipset_envopt_IPSET_ENV_BIT_LIST_SETNAME: ipset_envopt = 4;
pub const ipset_envopt_IPSET_ENV_LIST_SETNAME: ipset_envopt = 16;
pub const ipset_envopt_IPSET_ENV_BIT_LIST_HEADER: ipset_envopt = 5;
pub const ipset_envopt_IPSET_ENV_LIST_HEADER: ipset_envopt = 32;
pub type ipset_envopt = ::std::os::raw::c_uint;
extern "C" {
    pub fn ipset_envopt_test(session: *mut ipset_session, env: ipset_envopt) -> bool;
}
extern "C" {
    pub fn ipset_envopt_set(session: *mut ipset_session, env: ipset_envopt);
}
extern "C" {
    pub fn ipset_envopt_unset(session: *mut ipset_session, env: ipset_envopt);
}
pub const ipset_output_mode_IPSET_LIST_NONE: ipset_output_mode = 0;
pub const ipset_output_mode_IPSET_LIST_PLAIN: ipset_output_mode = 1;
pub const ipset_output_mode_IPSET_LIST_SAVE: ipset_output_mode = 2;
pub const ipset_output_mode_IPSET_LIST_XML: ipset_output_mode = 3;
pub type ipset_output_mode = ::std::os::raw::c_uint;
extern "C" {
    pub fn ipset_session_output(
        session: *mut ipset_session,
        mode: ipset_output_mode,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_commit(session: *mut ipset_session) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_cmd(
        session: *mut ipset_session,
        cmd: ipset_cmd,
        lineno: u32,
    ) -> ::std::os::raw::c_int;
}
pub type ipset_print_outfn = ::std::option::Option<
    unsafe extern "C" fn(
        session: *mut ipset_session,
        p: *mut ::std::os::raw::c_void,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn ipset_session_print_outfn(
        session: *mut ipset_session,
        outfn: ipset_print_outfn,
        p: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
pub const ipset_io_type_IPSET_IO_INPUT: ipset_io_type = 0;
pub const ipset_io_type_IPSET_IO_OUTPUT: ipset_io_type = 1;
pub type ipset_io_type = ::std::os::raw::c_uint;
extern "C" {
    pub fn ipset_session_io_full(
        session: *mut ipset_session,
        filename: *const ::std::os::raw::c_char,
        what: ipset_io_type,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_session_io_normal(
        session: *mut ipset_session,
        filename: *const ::std::os::raw::c_char,
        what: ipset_io_type,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_session_io_stream(session: *mut ipset_session, what: ipset_io_type) -> *mut FILE;
}
extern "C" {
    pub fn ipset_session_io_close(
        session: *mut ipset_session,
        what: ipset_io_type,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_session_init(
        outfn: ipset_print_outfn,
        p: *mut ::std::os::raw::c_void,
    ) -> *mut ipset_session;
}
extern "C" {
    pub fn ipset_session_fini(session: *mut ipset_session) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_debug_msg(
        dir: *const ::std::os::raw::c_char,
        buffer: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    );
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub const ipset_keywords_IPSET_ARG_NONE: ipset_keywords = 0;
pub const ipset_keywords_IPSET_ARG_FAMILY: ipset_keywords = 1;
pub const ipset_keywords_IPSET_ARG_INET: ipset_keywords = 2;
pub const ipset_keywords_IPSET_ARG_INET6: ipset_keywords = 3;
pub const ipset_keywords_IPSET_ARG_HASHSIZE: ipset_keywords = 4;
pub const ipset_keywords_IPSET_ARG_MAXELEM: ipset_keywords = 5;
pub const ipset_keywords_IPSET_ARG_PROBES: ipset_keywords = 6;
pub const ipset_keywords_IPSET_ARG_RESIZE: ipset_keywords = 7;
pub const ipset_keywords_IPSET_ARG_GC: ipset_keywords = 8;
pub const ipset_keywords_IPSET_ARG_IGNORED_FROM: ipset_keywords = 9;
pub const ipset_keywords_IPSET_ARG_IGNORED_TO: ipset_keywords = 10;
pub const ipset_keywords_IPSET_ARG_IGNORED_NETWORK: ipset_keywords = 11;
pub const ipset_keywords_IPSET_ARG_SIZE: ipset_keywords = 12;
pub const ipset_keywords_IPSET_ARG_IPRANGE: ipset_keywords = 13;
pub const ipset_keywords_IPSET_ARG_NETMASK: ipset_keywords = 14;
pub const ipset_keywords_IPSET_ARG_PORTRANGE: ipset_keywords = 15;
pub const ipset_keywords_IPSET_ARG_BEFORE: ipset_keywords = 16;
pub const ipset_keywords_IPSET_ARG_AFTER: ipset_keywords = 17;
pub const ipset_keywords_IPSET_ARG_FROM_IP: ipset_keywords = 18;
pub const ipset_keywords_IPSET_ARG_TO_IP: ipset_keywords = 19;
pub const ipset_keywords_IPSET_ARG_NETWORK: ipset_keywords = 20;
pub const ipset_keywords_IPSET_ARG_FROM_PORT: ipset_keywords = 21;
pub const ipset_keywords_IPSET_ARG_TO_PORT: ipset_keywords = 22;
pub const ipset_keywords_IPSET_ARG_FORCEADD: ipset_keywords = 23;
pub const ipset_keywords_IPSET_ARG_MARKMASK: ipset_keywords = 24;
pub const ipset_keywords_IPSET_ARG_NOMATCH: ipset_keywords = 25;
pub const ipset_keywords_IPSET_ARG_IFACE_WILDCARD: ipset_keywords = 26;
pub const ipset_keywords_IPSET_ARG_TIMEOUT: ipset_keywords = 27;
pub const ipset_keywords_IPSET_ARG_COUNTERS: ipset_keywords = 28;
pub const ipset_keywords_IPSET_ARG_PACKETS: ipset_keywords = 29;
pub const ipset_keywords_IPSET_ARG_BYTES: ipset_keywords = 30;
pub const ipset_keywords_IPSET_ARG_COMMENT: ipset_keywords = 31;
pub const ipset_keywords_IPSET_ARG_ADT_COMMENT: ipset_keywords = 32;
pub const ipset_keywords_IPSET_ARG_SKBINFO: ipset_keywords = 33;
pub const ipset_keywords_IPSET_ARG_SKBMARK: ipset_keywords = 34;
pub const ipset_keywords_IPSET_ARG_SKBPRIO: ipset_keywords = 35;
pub const ipset_keywords_IPSET_ARG_SKBQUEUE: ipset_keywords = 36;
pub const ipset_keywords_IPSET_ARG_BUCKETSIZE: ipset_keywords = 37;
pub const ipset_keywords_IPSET_ARG_INITVAL: ipset_keywords = 38;
pub const ipset_keywords_IPSET_ARG_MAX: ipset_keywords = 39;
pub type ipset_keywords = ::std::os::raw::c_uint;
extern "C" {
    pub fn ipset_keyword(i: ipset_keywords) -> *const ipset_arg;
}
extern "C" {
    pub fn ipset_ignored_optname(opt: ::std::os::raw::c_uint) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: size_t,
}
#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iovec>())).iov_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iovec>())).iov_len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__once_flag>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).ss_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_padding as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_align as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
pub const MSG_OOB: ::std::os::raw::c_uint = 1;
pub const MSG_PEEK: ::std::os::raw::c_uint = 2;
pub const MSG_DONTROUTE: ::std::os::raw::c_uint = 4;
pub const MSG_CTRUNC: ::std::os::raw::c_uint = 8;
pub const MSG_PROXY: ::std::os::raw::c_uint = 16;
pub const MSG_TRUNC: ::std::os::raw::c_uint = 32;
pub const MSG_DONTWAIT: ::std::os::raw::c_uint = 64;
pub const MSG_EOR: ::std::os::raw::c_uint = 128;
pub const MSG_WAITALL: ::std::os::raw::c_uint = 256;
pub const MSG_FIN: ::std::os::raw::c_uint = 512;
pub const MSG_SYN: ::std::os::raw::c_uint = 1024;
pub const MSG_CONFIRM: ::std::os::raw::c_uint = 2048;
pub const MSG_RST: ::std::os::raw::c_uint = 4096;
pub const MSG_ERRQUEUE: ::std::os::raw::c_uint = 8192;
pub const MSG_NOSIGNAL: ::std::os::raw::c_uint = 16384;
pub const MSG_MORE: ::std::os::raw::c_uint = 32768;
pub const MSG_WAITFORONE: ::std::os::raw::c_uint = 65536;
pub const MSG_BATCH: ::std::os::raw::c_uint = 262144;
pub const MSG_ZEROCOPY: ::std::os::raw::c_uint = 67108864;
pub const MSG_FASTOPEN: ::std::os::raw::c_uint = 536870912;
pub const MSG_CMSG_CLOEXEC: ::std::os::raw::c_uint = 1073741824;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: size_t,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: size_t,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_namelen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iov as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iovlen as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_control as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_controllen as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: size_t,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).cmsg_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).cmsg_level as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).cmsg_type as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).__cmsg_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(__cmsg_data)
        )
    );
}
extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<linger>())).l_onoff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_onoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<linger>())).l_linger as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_linger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
pub const SHUT_RD: ::std::os::raw::c_uint = 0;
pub const SHUT_WR: ::std::os::raw::c_uint = 1;
pub const SHUT_RDWR: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_ip_opts() {
    assert_eq!(
        ::std::mem::size_of::<ip_opts>(),
        44usize,
        concat!("Size of: ", stringify!(ip_opts))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_opts>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_opts))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_dst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_opts as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_opts)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreqn>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreqn))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreqn>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreqn))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_address as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_ifindex as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[test]
fn bindgen_test_layout_in_pktinfo() {
    assert_eq!(
        ::std::mem::size_of::<in_pktinfo>(),
        12usize,
        concat!("Size of: ", stringify!(in_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in_pktinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_ifindex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_spec_dst as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_spec_dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_addr)
        )
    );
}
pub const IPPROTO_IP: ::std::os::raw::c_uint = 0;
pub const IPPROTO_ICMP: ::std::os::raw::c_uint = 1;
pub const IPPROTO_IGMP: ::std::os::raw::c_uint = 2;
pub const IPPROTO_IPIP: ::std::os::raw::c_uint = 4;
pub const IPPROTO_TCP: ::std::os::raw::c_uint = 6;
pub const IPPROTO_EGP: ::std::os::raw::c_uint = 8;
pub const IPPROTO_PUP: ::std::os::raw::c_uint = 12;
pub const IPPROTO_UDP: ::std::os::raw::c_uint = 17;
pub const IPPROTO_IDP: ::std::os::raw::c_uint = 22;
pub const IPPROTO_TP: ::std::os::raw::c_uint = 29;
pub const IPPROTO_DCCP: ::std::os::raw::c_uint = 33;
pub const IPPROTO_IPV6: ::std::os::raw::c_uint = 41;
pub const IPPROTO_RSVP: ::std::os::raw::c_uint = 46;
pub const IPPROTO_GRE: ::std::os::raw::c_uint = 47;
pub const IPPROTO_ESP: ::std::os::raw::c_uint = 50;
pub const IPPROTO_AH: ::std::os::raw::c_uint = 51;
pub const IPPROTO_MTP: ::std::os::raw::c_uint = 92;
pub const IPPROTO_BEETPH: ::std::os::raw::c_uint = 94;
pub const IPPROTO_ENCAP: ::std::os::raw::c_uint = 98;
pub const IPPROTO_PIM: ::std::os::raw::c_uint = 103;
pub const IPPROTO_COMP: ::std::os::raw::c_uint = 108;
pub const IPPROTO_SCTP: ::std::os::raw::c_uint = 132;
pub const IPPROTO_UDPLITE: ::std::os::raw::c_uint = 136;
pub const IPPROTO_MPLS: ::std::os::raw::c_uint = 137;
pub const IPPROTO_ETHERNET: ::std::os::raw::c_uint = 143;
pub const IPPROTO_RAW: ::std::os::raw::c_uint = 255;
pub const IPPROTO_MPTCP: ::std::os::raw::c_uint = 262;
pub const IPPROTO_MAX: ::std::os::raw::c_uint = 263;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const IPPROTO_HOPOPTS: ::std::os::raw::c_uint = 0;
pub const IPPROTO_ROUTING: ::std::os::raw::c_uint = 43;
pub const IPPROTO_FRAGMENT: ::std::os::raw::c_uint = 44;
pub const IPPROTO_ICMPV6: ::std::os::raw::c_uint = 58;
pub const IPPROTO_NONE: ::std::os::raw::c_uint = 59;
pub const IPPROTO_DSTOPTS: ::std::os::raw::c_uint = 60;
pub const IPPROTO_MH: ::std::os::raw::c_uint = 135;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
pub type in_port_t = u16;
pub const IPPORT_ECHO: ::std::os::raw::c_uint = 7;
pub const IPPORT_DISCARD: ::std::os::raw::c_uint = 9;
pub const IPPORT_SYSTAT: ::std::os::raw::c_uint = 11;
pub const IPPORT_DAYTIME: ::std::os::raw::c_uint = 13;
pub const IPPORT_NETSTAT: ::std::os::raw::c_uint = 15;
pub const IPPORT_FTP: ::std::os::raw::c_uint = 21;
pub const IPPORT_TELNET: ::std::os::raw::c_uint = 23;
pub const IPPORT_SMTP: ::std::os::raw::c_uint = 25;
pub const IPPORT_TIMESERVER: ::std::os::raw::c_uint = 37;
pub const IPPORT_NAMESERVER: ::std::os::raw::c_uint = 42;
pub const IPPORT_WHOIS: ::std::os::raw::c_uint = 43;
pub const IPPORT_MTP: ::std::os::raw::c_uint = 57;
pub const IPPORT_TFTP: ::std::os::raw::c_uint = 69;
pub const IPPORT_RJE: ::std::os::raw::c_uint = 77;
pub const IPPORT_FINGER: ::std::os::raw::c_uint = 79;
pub const IPPORT_TTYLINK: ::std::os::raw::c_uint = 87;
pub const IPPORT_SUPDUP: ::std::os::raw::c_uint = 95;
pub const IPPORT_EXECSERVER: ::std::os::raw::c_uint = 512;
pub const IPPORT_LOGINSERVER: ::std::os::raw::c_uint = 513;
pub const IPPORT_CMDSERVER: ::std::os::raw::c_uint = 514;
pub const IPPORT_EFSSERVER: ::std::os::raw::c_uint = 520;
pub const IPPORT_BIFFUDP: ::std::os::raw::c_uint = 512;
pub const IPPORT_WHOSERVER: ::std::os::raw::c_uint = 513;
pub const IPPORT_ROUTESERVER: ::std::os::raw::c_uint = 520;
pub const IPPORT_RESERVED: ::std::os::raw::c_uint = 1024;
pub const IPPORT_USERRESERVED: ::std::os::raw::c_uint = 5000;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr8 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in6_addr>())).__in6_u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__in6_u)
        )
    );
}
extern "C" {
    pub static in6addr_any: in6_addr;
}
extern "C" {
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_zero as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_zero)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_flowinfo as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_scope_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreq>(),
        8usize,
        concat!("Size of: ", stringify!(ip_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq_source() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreq_source>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq_source>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_sourceaddr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_sourceaddr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipv6_mreq() {
    assert_eq!(
        ::std::mem::size_of::<ipv6_mreq>(),
        20usize,
        concat!("Size of: ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ipv6_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_interface as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_interface)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_req() {
    assert_eq!(
        ::std::mem::size_of::<group_req>(),
        136usize,
        concat!("Size of: ", stringify!(group_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_req))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_req>())).gr_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_req>())).gr_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_group)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_source_req() {
    assert_eq!(
        ::std::mem::size_of::<group_source_req>(),
        264usize,
        concat!("Size of: ", stringify!(group_source_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_source_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_source_req))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_source as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_source)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[test]
fn bindgen_test_layout_ip_msfilter() {
    assert_eq!(
        ::std::mem::size_of::<ip_msfilter>(),
        20usize,
        concat!("Size of: ", stringify!(ip_msfilter))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_msfilter>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_msfilter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_fmode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_fmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_numsrc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_numsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_slist as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_slist)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[test]
fn bindgen_test_layout_group_filter() {
    assert_eq!(
        ::std::mem::size_of::<group_filter>(),
        272usize,
        concat!("Size of: ", stringify!(group_filter))
    );
    assert_eq!(
        ::std::mem::align_of::<group_filter>(),
        8usize,
        concat!("Alignment of ", stringify!(group_filter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_fmode as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_fmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_numsrc as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_numsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_slist as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_slist)
        )
    );
}
extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union nf_inet_addr {
    pub all: [u32; 4usize],
    pub ip: u32,
    pub ip6: [u32; 4usize],
    pub in_: in_addr,
    pub in6: in6_addr,
}
#[test]
fn bindgen_test_layout_nf_inet_addr() {
    assert_eq!(
        ::std::mem::size_of::<nf_inet_addr>(),
        16usize,
        concat!("Size of: ", stringify!(nf_inet_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<nf_inet_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(nf_inet_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nf_inet_addr>())).all as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nf_inet_addr),
            "::",
            stringify!(all)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nf_inet_addr>())).ip as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nf_inet_addr),
            "::",
            stringify!(ip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nf_inet_addr>())).ip6 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nf_inet_addr),
            "::",
            stringify!(ip6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nf_inet_addr>())).in_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nf_inet_addr),
            "::",
            stringify!(in_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nf_inet_addr>())).in6 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nf_inet_addr),
            "::",
            stringify!(in6)
        )
    );
}
pub const ipset_opt_IPSET_OPT_NONE: ipset_opt = 0;
pub const ipset_opt_IPSET_SETNAME: ipset_opt = 1;
pub const ipset_opt_IPSET_OPT_TYPENAME: ipset_opt = 2;
pub const ipset_opt_IPSET_OPT_FAMILY: ipset_opt = 3;
pub const ipset_opt_IPSET_OPT_IP: ipset_opt = 4;
pub const ipset_opt_IPSET_OPT_IP_FROM: ipset_opt = 4;
pub const ipset_opt_IPSET_OPT_IP_TO: ipset_opt = 5;
pub const ipset_opt_IPSET_OPT_CIDR: ipset_opt = 6;
pub const ipset_opt_IPSET_OPT_MARK: ipset_opt = 7;
pub const ipset_opt_IPSET_OPT_PORT: ipset_opt = 8;
pub const ipset_opt_IPSET_OPT_PORT_FROM: ipset_opt = 8;
pub const ipset_opt_IPSET_OPT_PORT_TO: ipset_opt = 9;
pub const ipset_opt_IPSET_OPT_TIMEOUT: ipset_opt = 10;
pub const ipset_opt_IPSET_OPT_GC: ipset_opt = 11;
pub const ipset_opt_IPSET_OPT_HASHSIZE: ipset_opt = 12;
pub const ipset_opt_IPSET_OPT_MAXELEM: ipset_opt = 13;
pub const ipset_opt_IPSET_OPT_MARKMASK: ipset_opt = 14;
pub const ipset_opt_IPSET_OPT_NETMASK: ipset_opt = 15;
pub const ipset_opt_IPSET_OPT_PROBES: ipset_opt = 16;
pub const ipset_opt_IPSET_OPT_RESIZE: ipset_opt = 17;
pub const ipset_opt_IPSET_OPT_SIZE: ipset_opt = 18;
pub const ipset_opt_IPSET_OPT_FORCEADD: ipset_opt = 19;
pub const ipset_opt_IPSET_OPT_ELEMENTS: ipset_opt = 20;
pub const ipset_opt_IPSET_OPT_REFERENCES: ipset_opt = 21;
pub const ipset_opt_IPSET_OPT_MEMSIZE: ipset_opt = 22;
pub const ipset_opt_IPSET_OPT_ETHER: ipset_opt = 23;
pub const ipset_opt_IPSET_OPT_NAME: ipset_opt = 24;
pub const ipset_opt_IPSET_OPT_NAMEREF: ipset_opt = 25;
pub const ipset_opt_IPSET_OPT_IP2: ipset_opt = 26;
pub const ipset_opt_IPSET_OPT_CIDR2: ipset_opt = 27;
pub const ipset_opt_IPSET_OPT_IP2_TO: ipset_opt = 28;
pub const ipset_opt_IPSET_OPT_PROTO: ipset_opt = 29;
pub const ipset_opt_IPSET_OPT_IFACE: ipset_opt = 30;
pub const ipset_opt_IPSET_OPT_SETNAME2: ipset_opt = 31;
pub const ipset_opt_IPSET_OPT_EXIST: ipset_opt = 32;
pub const ipset_opt_IPSET_OPT_BEFORE: ipset_opt = 33;
pub const ipset_opt_IPSET_OPT_PHYSDEV: ipset_opt = 34;
pub const ipset_opt_IPSET_OPT_NOMATCH: ipset_opt = 35;
pub const ipset_opt_IPSET_OPT_COUNTERS: ipset_opt = 36;
pub const ipset_opt_IPSET_OPT_PACKETS: ipset_opt = 37;
pub const ipset_opt_IPSET_OPT_BYTES: ipset_opt = 38;
pub const ipset_opt_IPSET_OPT_CREATE_COMMENT: ipset_opt = 39;
pub const ipset_opt_IPSET_OPT_ADT_COMMENT: ipset_opt = 40;
pub const ipset_opt_IPSET_OPT_SKBINFO: ipset_opt = 41;
pub const ipset_opt_IPSET_OPT_SKBMARK: ipset_opt = 42;
pub const ipset_opt_IPSET_OPT_SKBPRIO: ipset_opt = 43;
pub const ipset_opt_IPSET_OPT_SKBQUEUE: ipset_opt = 44;
pub const ipset_opt_IPSET_OPT_IFACE_WILDCARD: ipset_opt = 45;
pub const ipset_opt_IPSET_OPT_BUCKETSIZE: ipset_opt = 46;
pub const ipset_opt_IPSET_OPT_INITVAL: ipset_opt = 47;
pub const ipset_opt_IPSET_OPT_FLAGS: ipset_opt = 48;
pub const ipset_opt_IPSET_OPT_CADT_FLAGS: ipset_opt = 49;
pub const ipset_opt_IPSET_OPT_ELEM: ipset_opt = 50;
pub const ipset_opt_IPSET_OPT_TYPE: ipset_opt = 51;
pub const ipset_opt_IPSET_OPT_LINENO: ipset_opt = 52;
pub const ipset_opt_IPSET_OPT_REVISION: ipset_opt = 53;
pub const ipset_opt_IPSET_OPT_REVISION_MIN: ipset_opt = 54;
pub const ipset_opt_IPSET_OPT_INDEX: ipset_opt = 55;
pub const ipset_opt_IPSET_OPT_MAX: ipset_opt = 56;
pub type ipset_opt = ::std::os::raw::c_uint;
extern "C" {
    pub fn ipset_strlcpy(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        len: size_t,
    );
}
extern "C" {
    pub fn ipset_strlcat(
        dst: *mut ::std::os::raw::c_char,
        src: *const ::std::os::raw::c_char,
        len: size_t,
    );
}
extern "C" {
    pub fn ipset_data_flags_test(data: *const ipset_data, flags: u64) -> bool;
}
extern "C" {
    pub fn ipset_data_flags_set(data: *mut ipset_data, flags: u64);
}
extern "C" {
    pub fn ipset_data_flags_unset(data: *mut ipset_data, flags: u64);
}
extern "C" {
    pub fn ipset_data_ignored(data: *mut ipset_data, opt: ipset_opt) -> bool;
}
extern "C" {
    pub fn ipset_data_test_ignored(data: *mut ipset_data, opt: ipset_opt) -> bool;
}
extern "C" {
    pub fn ipset_data_set(
        data: *mut ipset_data,
        opt: ipset_opt,
        value: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_data_get(data: *const ipset_data, opt: ipset_opt)
        -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn ipset_data_setname(data: *const ipset_data) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ipset_data_family(data: *const ipset_data) -> u8;
}
extern "C" {
    pub fn ipset_data_cidr(data: *const ipset_data) -> u8;
}
extern "C" {
    pub fn ipset_data_flags(data: *const ipset_data) -> u64;
}
extern "C" {
    pub fn ipset_data_reset(data: *mut ipset_data);
}
extern "C" {
    pub fn ipset_data_init() -> *mut ipset_data;
}
extern "C" {
    pub fn ipset_data_fini(data: *mut ipset_data);
}
extern "C" {
    pub fn ipset_data_sizeof(opt: ipset_opt, family: u8) -> size_t;
}
pub type ipset_parsefn = ::std::option::Option<
    unsafe extern "C" fn(
        s: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn ipset_parse_ether(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
        proto: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_mark(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_tcpudp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
        proto: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_tcp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_single_tcp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_proto(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_icmp(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_icmpv6(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_proto_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_tcp_udp_port(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_family(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_ip(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_single_ip(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_net(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_range(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_netrange(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_iprange(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_ipnet(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_ip4_single6(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_ip4_net6(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_name(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_before(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_after(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_setname(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_timeout(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_uint64(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_uint32(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_uint16(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_uint8(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_netmask(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_flag(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_typename(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_iface(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_comment(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_skbmark(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_skbprio(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_ignored(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_elem(
        session: *mut ipset_session,
        optional: bool,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_call_parser(
        session: *mut ipset_session,
        arg: *const ipset_arg,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_iptimeout(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_name_compat(
        session: *mut ipset_session,
        opt: ipset_opt,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
pub type ipset_printfn = ::std::option::Option<
    unsafe extern "C" fn(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn ipset_print_ether(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_family(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_type(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_ip(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_ipaddr(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_number(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_hexnumber(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_name(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_port(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_mark(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_iface(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_comment(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_skbmark(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_skbprio(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_proto(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_icmp(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_icmpv6(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_proto_port(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_flag(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_elem(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_print_data(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        data: *const ipset_data,
        opt: ipset_opt,
        env: u8,
    ) -> ::std::os::raw::c_int;
}
pub const NFPROTO_UNSPEC: ::std::os::raw::c_uint = 0;
pub const NFPROTO_IPV4: ::std::os::raw::c_uint = 2;
pub const NFPROTO_ARP: ::std::os::raw::c_uint = 3;
pub const NFPROTO_BRIDGE: ::std::os::raw::c_uint = 7;
pub const NFPROTO_IPV6: ::std::os::raw::c_uint = 10;
pub const NFPROTO_DECNET: ::std::os::raw::c_uint = 12;
pub const NFPROTO_NUMPROTO: ::std::os::raw::c_uint = 13;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
pub const NFPROTO_IPSET_IPV46: ::std::os::raw::c_uint = 255;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
pub const IPSET_NO_ARG: ::std::os::raw::c_int = -1;
pub const IPSET_OPTIONAL_ARG: ::std::os::raw::c_int = 0;
pub const IPSET_MANDATORY_ARG: ::std::os::raw::c_int = 1;
pub const IPSET_MANDATORY_ARG2: ::std::os::raw::c_int = 2;
pub type _bindgen_ty_14 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_arg {
    pub name: [*const ::std::os::raw::c_char; 2usize],
    pub has_arg: ::std::os::raw::c_int,
    pub opt: ipset_opt,
    pub parse: ipset_parsefn,
    pub print: ipset_printfn,
    pub help: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ipset_arg() {
    assert_eq!(
        ::std::mem::size_of::<ipset_arg>(),
        48usize,
        concat!("Size of: ", stringify!(ipset_arg))
    );
    assert_eq!(
        ::std::mem::align_of::<ipset_arg>(),
        8usize,
        concat!("Alignment of ", stringify!(ipset_arg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_arg>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_arg),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_arg>())).has_arg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_arg),
            "::",
            stringify!(has_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_arg>())).opt as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_arg),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_arg>())).parse as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_arg),
            "::",
            stringify!(parse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_arg>())).print as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_arg),
            "::",
            stringify!(print)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_arg>())).help as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_arg),
            "::",
            stringify!(help)
        )
    );
}
pub const IPSET_KERNEL_MISMATCH: ::std::os::raw::c_int = -1;
pub const IPSET_KERNEL_CHECK_NEEDED: ::std::os::raw::c_int = 0;
pub const IPSET_KERNEL_OK: ::std::os::raw::c_int = 1;
pub type _bindgen_ty_15 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_elem {
    pub parse: ipset_parsefn,
    pub print: ipset_printfn,
    pub opt: ipset_opt,
}
#[test]
fn bindgen_test_layout_ipset_elem() {
    assert_eq!(
        ::std::mem::size_of::<ipset_elem>(),
        24usize,
        concat!("Size of: ", stringify!(ipset_elem))
    );
    assert_eq!(
        ::std::mem::align_of::<ipset_elem>(),
        8usize,
        concat!("Alignment of ", stringify!(ipset_elem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_elem>())).parse as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_elem),
            "::",
            stringify!(parse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_elem>())).print as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_elem),
            "::",
            stringify!(print)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_elem>())).opt as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_elem),
            "::",
            stringify!(opt)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_optarg {
    pub args: [ipset_keywords; 24usize],
    pub need: u64,
    pub full: u64,
    pub help: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ipset_optarg() {
    assert_eq!(
        ::std::mem::size_of::<ipset_optarg>(),
        120usize,
        concat!("Size of: ", stringify!(ipset_optarg))
    );
    assert_eq!(
        ::std::mem::align_of::<ipset_optarg>(),
        8usize,
        concat!("Alignment of ", stringify!(ipset_optarg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_optarg>())).args as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_optarg),
            "::",
            stringify!(args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_optarg>())).need as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_optarg),
            "::",
            stringify!(need)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_optarg>())).full as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_optarg),
            "::",
            stringify!(full)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_optarg>())).help as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_optarg),
            "::",
            stringify!(help)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct ipset_type {
    pub name: *const ::std::os::raw::c_char,
    pub revision: u8,
    pub family: u8,
    pub dimension: u8,
    pub kernel_check: i8,
    pub last_elem_optional: bool,
    pub elem: [ipset_elem; 3usize],
    pub compat_parse_elem: ipset_parsefn,
    pub cmd: [ipset_optarg; 4usize],
    pub usage: *const ::std::os::raw::c_char,
    pub usagefn: ::std::option::Option<unsafe extern "C" fn()>,
    pub description: *const ::std::os::raw::c_char,
    pub next: *mut ipset_type,
    pub alias: __IncompleteArrayField<*const ::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_ipset_type() {
    assert_eq!(
        ::std::mem::size_of::<ipset_type>(),
        608usize,
        concat!("Size of: ", stringify!(ipset_type))
    );
    assert_eq!(
        ::std::mem::align_of::<ipset_type>(),
        8usize,
        concat!("Alignment of ", stringify!(ipset_type))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).revision as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).family as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).dimension as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(dimension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).kernel_check as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(kernel_check)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).last_elem_optional as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(last_elem_optional)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).elem as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(elem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).compat_parse_elem as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(compat_parse_elem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).cmd as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).usage as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(usage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).usagefn as *const _ as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(usagefn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).description as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).next as *const _ as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_type>())).alias as *const _ as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_type),
            "::",
            stringify!(alias)
        )
    );
}
extern "C" {
    pub fn ipset_cache_add(
        name: *const ::std::os::raw::c_char,
        type_: *const ipset_type,
        family: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_cache_del(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_cache_rename(
        from: *const ::std::os::raw::c_char,
        to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_cache_swap(
        from: *const ::std::os::raw::c_char,
        to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_cache_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_cache_fini();
}
extern "C" {
    pub fn ipset_type_get(session: *mut ipset_session, cmd: ipset_cmd) -> *const ipset_type;
}
extern "C" {
    pub fn ipset_type_check(session: *mut ipset_session) -> *const ipset_type;
}
extern "C" {
    pub fn ipset_type_higher_rev(type_: *const ipset_type) -> *const ipset_type;
}
extern "C" {
    pub fn ipset_type_add(type_: *mut ipset_type) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_types() -> *const ipset_type;
}
extern "C" {
    pub fn ipset_typename_resolve(
        str_: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ipset_match_typename(str_: *const ::std::os::raw::c_char, t: *const ipset_type) -> bool;
}
extern "C" {
    pub fn ipset_load_types();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_commands {
    pub cmd: ipset_cmd,
    pub has_arg: ::std::os::raw::c_int,
    pub name: [*const ::std::os::raw::c_char; 3usize],
    pub help: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_ipset_commands() {
    assert_eq!(
        ::std::mem::size_of::<ipset_commands>(),
        40usize,
        concat!("Size of: ", stringify!(ipset_commands))
    );
    assert_eq!(
        ::std::mem::align_of::<ipset_commands>(),
        8usize,
        concat!("Alignment of ", stringify!(ipset_commands))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_commands>())).cmd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_commands),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_commands>())).has_arg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_commands),
            "::",
            stringify!(has_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_commands>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_commands),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_commands>())).help as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_commands),
            "::",
            stringify!(help)
        )
    );
}
extern "C" {
    pub static mut ipset_commands: [ipset_commands; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ipset_envopts {
    pub flag: ::std::os::raw::c_int,
    pub has_arg: ::std::os::raw::c_int,
    pub name: [*const ::std::os::raw::c_char; 2usize],
    pub help: *const ::std::os::raw::c_char,
    pub parse: ::std::option::Option<
        unsafe extern "C" fn(
            ipset: *mut ipset,
            flag: ::std::os::raw::c_int,
            str_: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub print: ::std::option::Option<
        unsafe extern "C" fn(
            buf: *mut ::std::os::raw::c_char,
            len: ::std::os::raw::c_uint,
            data: *const ipset_data,
            flag: ::std::os::raw::c_int,
            env: u8,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_ipset_envopts() {
    assert_eq!(
        ::std::mem::size_of::<ipset_envopts>(),
        48usize,
        concat!("Size of: ", stringify!(ipset_envopts))
    );
    assert_eq!(
        ::std::mem::align_of::<ipset_envopts>(),
        8usize,
        concat!("Alignment of ", stringify!(ipset_envopts))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_envopts>())).flag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_envopts),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_envopts>())).has_arg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_envopts),
            "::",
            stringify!(has_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_envopts>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_envopts),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_envopts>())).help as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_envopts),
            "::",
            stringify!(help)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_envopts>())).parse as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_envopts),
            "::",
            stringify!(parse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipset_envopts>())).print as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ipset_envopts),
            "::",
            stringify!(print)
        )
    );
}
extern "C" {
    pub static mut ipset_envopts: [ipset_envopts; 0usize];
}
extern "C" {
    pub fn ipset_match_cmd(
        arg: *const ::std::os::raw::c_char,
        name: *const *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn ipset_match_option(
        arg: *const ::std::os::raw::c_char,
        name: *const *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn ipset_match_envopt(
        arg: *const ::std::os::raw::c_char,
        name: *const *const ::std::os::raw::c_char,
    ) -> bool;
}
extern "C" {
    pub fn ipset_port_usage();
}
extern "C" {
    pub fn ipset_parse_filename(
        ipset: *mut ipset,
        opt: ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_output(
        ipset: *mut ipset,
        opt: ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_envopt_parse(
        ipset: *mut ipset,
        env: ::std::os::raw::c_int,
        str_: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
pub const ipset_exittype_IPSET_NO_PROBLEM: ipset_exittype = 0;
pub const ipset_exittype_IPSET_OTHER_PROBLEM: ipset_exittype = 1;
pub const ipset_exittype_IPSET_PARAMETER_PROBLEM: ipset_exittype = 2;
pub const ipset_exittype_IPSET_VERSION_PROBLEM: ipset_exittype = 3;
pub const ipset_exittype_IPSET_SESSION_PROBLEM: ipset_exittype = 4;
pub type ipset_exittype = ::std::os::raw::c_uint;
pub type ipset_custom_errorfn = ::std::option::Option<
    unsafe extern "C" fn(
        ipset: *mut ipset,
        p: *mut ::std::os::raw::c_void,
        status: ::std::os::raw::c_int,
        msg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int,
>;
pub type ipset_standard_errorfn = ::std::option::Option<
    unsafe extern "C" fn(
        ipset: *mut ipset,
        p: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn ipset_session(ipset: *mut ipset) -> *mut ipset_session;
}
extern "C" {
    pub fn ipset_is_interactive(ipset: *mut ipset) -> bool;
}
extern "C" {
    pub fn ipset_custom_printf(
        ipset: *mut ipset,
        custom_error: ipset_custom_errorfn,
        standard_error: ipset_standard_errorfn,
        outfn: ipset_print_outfn,
        p: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_argv(
        ipset: *mut ipset,
        argc: ::std::os::raw::c_int,
        argv: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_line(
        ipset: *mut ipset,
        line: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_parse_stream(ipset: *mut ipset, f: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ipset_init() -> *mut ipset;
}
extern "C" {
    pub fn ipset_fini(ipset: *mut ipset) -> ::std::os::raw::c_int;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    assert_eq!(
        ::std::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).gp_offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).fp_offset as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).overflow_arg_area as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__va_list_tag>())).reg_save_area as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
